# -*- coding: utf-8 -*-
"""
Created on Wed Sep  8 16:23:07 2021

@author: Iliopoulou
"""
'''Scrabble 2021 - Ηλιοπούλου, Α.Ε.Μ.: 14869'''
import classes

game = classes.Game()
game.menu()


def guidelines():
    '''
Αρχικά, έχω φτιάξει το αρχείο classes.py που περιέχει ό,τι χρειάζεται το πρόγραμμα.
    
Στην αρχή, μετά την εισαγωγή των γραμμάτων με τον προτινώμενο τρόπο. υπάρχουν κάποιες συναρτήσεις που 
χρησιμοποίησα αργότερα μέσα στις κλάσεις, για να απλοποίησω τον κώδικά μου.
    
Η συνάρτηση value που υπολογίζει την αξία (πόντους) μιας λέξης και είναι πολύ χρήσιμη και για να μετράμε το 
σκορ των παικτών, αλλά και για την ρύθμιση του σεναρίου του Η/Υ.
    
Η συνάρτηση freq μας δείχνει την συχνότητα ενός γράμματος, δηλαδή πόσες φορές πρέπει να το συμπεριλάβουμε στο 
σύνολο των γραμμάτων που έχουμε για να παίξουμε, και χρησιμοποιήθηκε στο γέμισμα του κεντρικού σακουλιού.
   
Επίσης, πολύ χρήσιμη φάνηκε η συνάρτηση που ελέγχει αν μια λέξη υπάρχει στο αρχείο greek7.txt,η accepted(w) 
που δίνει λογικές τιμές True αν υπάρχει και False άμα δεν υπάρχει.
    
Καθώς και η exist(w,lex) που ελέγχει αν τα γράμματα της λέξης w υπάρχουν στο σύνολο lex και χρησίμευσε στο να 
ελέγχω αν η λέξη που γράφει ο παίκτης αποτελείται από γράμματα που υπάρχουν στο σακουλάκι. Ο λόγος που έχω 
κάνει λίστα το lex και χρησιμοποίησα τη μέθοδο remove είναι για να μπορώ να συμπεριλάβω την περίπτωση όπου 
υπάρχει το γράμμα στο σακουλάκι μου, αλλά εγώ το έβαλα στην λέξη περισσότερες φορε΄ς από όσες υπήρχε.

--------------------------------------------------------------------------------------------------------------
    
ΚΛΑΣΕΙΣ:
    
     Κλάση SakClass: 
         
     Για να βάλουμε γράμματα στο σακουλάκι υπάρχει η add_letters που έχει δύο παραμέτρους, η μία είναι το 
     γράμμα που θα προσθεθεί στο σακουλάκι και η άλλη το πλήθος (εδώ χρησιμοποιώ την freq).
     
     H συναρτήσεις getletters και putbackletters δέχονται ως παράμετρο τον αριθμό των γραμμάτων που παίρνουμε
     ή επιστρέφουμε στο σακουλάκι και έχουν την αντίστοιχη λειτουργία. 
     
     Η συνάρτηση randomize_sak όπου ανακτατεύει τα γράμματα στο σακουλ΄άκι (δεν θα θέλαμε σε καμία περίπτωση να 
     είναι ταξινομιμένα, π.χ. αλφαβητικα).
     
     ---------------------------------------------------------------------------------------------------------
     
     Κλάση Player: 
         
     Περιέχει μια λίστα με τα γράμματα του παίκτη και το σκορ του.
     
     Η μέθοδος restore_letters καλείται για να αναληρώσει όσα γράμματα έχει παίξει ο παίκτης.
     
     Η change_letters αλλάζει όλα τα γράμματα του παίκτη κι επιστρέφει στο σακουλάκι τα παλιά (αφού πατηθεί 
     το 'p').
     
     ---------------------------------------------------------------------------------------------------------
     
     Κλάση Human:
         
     Kληρωνομεί την Player. Επιπλέον έχει τη μέθοδο play η οποία ζητά από τον παίκτη να δώσει μία λέξη και
     ελέγχει αν αυτή η λέξη είναι αποδεκτή  (υπάρχει στο gr7 με τη βοήθεια της accepted(w),
     αν μπορεί να γραφεί με τα γράμματα που διαθέτει ο παίκτης (exist(w,l)) και αποκαθιστά τα γράμματα του.
     
     ---------------------------------------------------------------------------------------------------------
     
     Κλάση Computer:
         
     Kληρονομεί την Player. 
     Έχει τη μέθοδο play που ανάλογα με το σενάριο (εδώ smart - fail) του Η/Υ παίζει μια λέξη, αφαιρεί τα
     γράμματα που παίχτηκαν και αποκαθιστά τον αριθμό τους με νέα. 
     
     Τη μέθοδο smartfail που προσπάθησα να την κάνω να προσομοιώνει το παίξιμο ενός ανθρώπου
     (περισσότερα παρακάτω στο σενάριο).
     
     ---------------------------------------------------------------------------------------------------------
     
     Κλάση Game:
         
     Με αυτήν επιτυγχάνεται η υλοποίηση των γύρων κάθε παιχνιδιού. 
     Με τη μέθοδο setup δημιουργεί τα στιγμιότοιπα των 2 παικτών, το σακουλάκι κι ό,τι άλλο είναι απαραίτητο
     για να ξεκινήσει το παινίδι. 
     
     Η μέθοδος run που τρέχει την παρτίδα με την εξης λογική: 
         Ζητάει μια έγκυρη λέξη από τον παίκτη, την βαθμολογεί (ή αλλάζει τα γράμματα αν δώθηκε 'p'). και 
     έπειτα δίνει τη σειρά στον υπολογιστή και βαθμολογεί την λέξη του. 
     Κάθε φορά, ελέγχεται το αν τα γράμματα του παίκτη έχουν τελειώσει κι άρα πρέπει να τερματιστεί το 
     παιχίδι. Για την αποκατάσαση των γραμμάτων είναι υπεύθηνη η μέθοδος play των παικτών κι όχι η
     κύρια λειτουργία του game. 
     Τέλος, κάθε έγγυρη λέξη συγκρίνεται με την τρέχουσα καλύτερη βαθμολογικά που έχει παιχτεί
     ώστε να καταγραφεί στο τέλος σαν στατιστικό. 
     
     Μόλις τελειώσει η παρτίδα καλέιται η end. 
     Η μέθοδος end όπου τυπώνει τα σκορ, τον νικητή και γράφει τα στατιστικά της παρτίδας σε εξωτερικό αρχείο. 
     
     Η μέθοδος menu όπου τυπώνει το μενού και τις διαθέσιμες επιλογές στον παίκτη και καλεί τις αντίστοιχες 
     λειτουργίες.
     
     Η μέθοδος show_score όπου τυπώνει τα περιεχόμενα που έχουν φορτωθεί από το εξωτερικό αρχείο - όταν 
     ο χρήστης το ζητήσει από το μενού.
     
--------------------------------------------------------------------------------------------------------------
     
ΔΟΜΗ ΤΩΝ ΛΕΞΕΩΝ:
    
    Χρησιμοποίησα λεξικό για λόγους ταχύτητας, καθώς δεν έχει τους δείκτες (indices) όπως η λίστα που κάθε 
    φορά πρέπει να σκαναριστεί όλη η λίστα από την αρχή μέχρι να βρεθεί αυτό που χρειάζεται.
    Στο λεξικό δεν υπάρχει τέτοιο πράγμα κι αυτό σημαίνει πως είτε 100 είτε 10000 λέξεις, στο λεξικό θα 
    βρεθούν με την ίδια χρονική καθυστέρηση, ενώ στην λίστα ο χρόνος αναμονής αυξάνεται με το πλήθος των 
    στοιχείων.
    
--------------------------------------------------------------------------------------------------------------

ΜΕΘΟΔΟΣ ΑΠΟΘΗΚΕΥΣΗΣ ΤΟΥ ΣΚΟΡ:
    
    Για να αποθηκεύσω τα στατιστικά δεδομένα και το σκορ σε κάθε παρτίδα προτίμησα τη βιβλιοθήκη json, γιατί
    η json είναι πιο γρήγορη καθώς δεν μετατρέπει τα αρχεία σε διαδικά (χρονοβόρα διαδικασία), όπως κάνει η
    pickle.
    Επίσης, με τη json δεν έχουμε προβήματα ασφάλειας, οπότε μπορεί άφοβα όποιος θέλε να ανοίξει το πρόγραμμά
    μου.

--------------------------------------------------------------------------------------------------------------

ΑΛΓΟΡΙΘΜΟΣ - ΣΕΝΑΡΙΟ:
    
    Το σενάριο που υλοποίησα ε΄ίναι το σενάριο 2 - SMART - FAIL. 
    Στην αρχή είχα φτιάξει το smart και το παιχνίδι μου είχε φανεί εξαιρετικά δύσκολο και όχι διασκεδαστικό.
    Έτσι, αποφάσισα να κάνω το σενάριο smart - fail και να προσομοιώσω όσο μπορώ ένα ανθρώπινο παίξιμο.
    Αυτό που έκανα είναι το εξής:
        α) Ξεκινάω και βρίσκω τους δυνατούς συνδιασμούς γραμμ΄άτων (με το permutations) από τους μεγαλύτερους
         στους μικρότερους.
        β) Ελέγχω αν οι συνδυασμοί αυτοί είναι αποδεκτές  λέξεις (accepted(w))
        γ) Αν είναι, τότε βάζω σε μια λίστα την λέξη και σε μια αλλή, στην αντίστοιχη θέση, την αξία της.
        δ) Στη συνέχεια, με τη βοήθεια της συνάρτησης zip, φτιάχνω μια δομή η οποία έχει ως στοιχεία πλειάδες
           με πρώτο στοιχείο την αξία της λέξης και δεύτερο την ίδια την λέξη και την ταξινομώ με την βοήθεια
           της sorted() ταξινομώ τα στοιχεία με αύξουσα σειρά αξίας.
        ε) Διαλέγω τυχαία έναν ακέραιο,n, από το 1 μέχρι το 10 και βρίσκω το υπόλοιπο της διαίρεσής του με
           το 4.
           Αν είναι διαφορετικό του μηδενός (για n=1,2,3,5,6,7,9,10), κάτι που έχει 80% πιθανότητα να συμβεί,
           τότε διαλέγω μία τυχαία λέξη στο τελευταίο 40% του μήκους της λίστας, όπου εκεί βρίσκονται οι
           λέξεις με τις μεγαλύτερες αξίες.
           Αν είναι μηδέν (για n=4,8), κάτι που έχει 20% πιθανότητα να συμβεί, τότε διαλέγω μία τυχαία λέξη
           στο πρώτο 60% του μήκους της λίστας, όπου εκεί βρίσκονται οι λέξεις με τις μικρότερες αξίες.
    Νομίζω με αυτόν τον τρόπο ο υπολογιστής παίζει σαν άνθρωπος που τις περισσότερες φορές βρίσκει μια καλή 
    επιλογή λέξης, αλλά που και που βρίσκει μια όχι και τόσο καλή.
    Με αυτόν τον τρόπο το παιχνίδι μου φάνηκε πιο ενδιαφέρον.
    Το παιχνίδι τελειώνει όταν τελειώσουν τα γράμματα ή όταν πατήσει κανείς το 'q'.
    
--------------------------------------------------------------------------------------------------------------
    
ΑΡΧΕΙΑ:
    
    Για να τρέξει σωστά το πρόγραμμα χρειάζεται το τρέχον αρχείο, main14869.py καθώς και το αρχείο με τις 
    κλάσεις classes.py, αλλά και το λεξικό greek7.txt.
    Όλα πρέπει να βρίσκονται στον ίδιο φάκελο.
    Το αρχείο data.json αν δεν υπάρχει, θα δημιουργηθεί αυτόματα χωρίς κανένα πρόβλημα.
    '''
    return
